In [1]:
import sqlite3

In [2]:
db_file = "../Day3/students_info_db.sqlite"

In [3]:
conn = sqlite3.connect(db_file)

In [4]:
cur = conn.cursor()

In [5]:
query = "SELECT * FROM 'Students'"

In [6]:
cur.execute(query)

In [7]:
for row in cur:
    print(row)

(1, 'Venkat', 'venat@a.com', '991144', 4, 'Python')
(2, 'Amit', 'amit@m.com', '5562819238', 0, 'Python')
(3, 'Girish', 'girish@h.com', '9900223847', 8, 'Shell Scripting')
(4, 'Sumit', 'sumit@s.com', '4499288393', 0, 'Shell Scripting')
(5, 'Nipun', 'nipun@s.com', '8827374920', 3, 'Python')

In [8]:
import pandas as pd

In [10]:
df = pd.read_sql("SELECT * FROM 'Students'", conn)

In [11]:
df

   emp_id    name         email       phone  exp           course
0       1  Venkat   venat@a.com      991144    4           Python
1       2    Amit    amit@m.com  5562819238    0           Python
2       3  Girish  girish@h.com  9900223847    8  Shell Scripting
3       4   Sumit   sumit@s.com  4499288393    0  Shell Scripting
4       5   Nipun   nipun@s.com  8827374920    3           Python

In [12]:
df[df.exp > 2]

   emp_id    name         email       phone  exp           course
0       1  Venkat   venat@a.com      991144    4           Python
2       3  Girish  girish@h.com  9900223847    8  Shell Scripting
4       5   Nipun   nipun@s.com  8827374920    3           Python

In [13]:
df[df.exp > 2].sort_values('exp')

   emp_id    name         email       phone  exp           course
4       5   Nipun   nipun@s.com  8827374920    3           Python
0       1  Venkat   venat@a.com      991144    4           Python
2       3  Girish  girish@h.com  9900223847    8  Shell Scripting

In [14]:
df2 = df[df.exp > 2].sort_values('exp')

In [15]:
cnx = sqlite3.connect("../Day3/best_students.sqlite")

In [16]:
df2.to_sql('Best', cnx)

3

In [17]:
pd.read_sql("SELECT * FROM 'Best'", cnx)

   index  emp_id    name         email       phone  exp           course
0      4       5   Nipun   nipun@s.com  8827374920    3           Python
1      0       1  Venkat   venat@a.com      991144    4           Python
2      2       3  Girish  girish@h.com  9900223847    8  Shell Scripting

This has extra column index

In [18]:
df2.to_sql('Best', cnx, index=False, if_exists='replace')

3

In [19]:
pd.read_sql("SELECT * FROM 'Best'", cnx)

   emp_id    name         email       phone  exp           course
0       5   Nipun   nipun@s.com  8827374920    3           Python
1       1  Venkat   venat@a.com      991144    4           Python
2       3  Girish  girish@h.com  9900223847    8  Shell Scripting

In [20]:
url_todos = "https://jsonplaceholder.typicode.com/todos"

In [21]:
import requests

resp = requests.get(url_todos)

In [22]:
resp.status_code

200

In [23]:
resp.ok

True

In [27]:
jdata = resp.json()

In [28]:
type(jdata)

list

In [29]:
len(jdata)

200

In [30]:
jdata[0]

{'userId': 1, 'id': 1, 'title': 'delectus aut autem', 'completed': False}

In [31]:
jdata[0]['userId']

1

In [33]:
# How many users have created todos (unique user ids)

count = 0
userids = set()
for elem in jdata:
    userids.add(elem['userId'])
userids
# or
{elm['userId'] for elm in jdata}

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [40]:
# For userid 7 how many todo items are completed?
count = 0
for elem in jdata:
    if (elem['userId'] == 7) and (elem['completed'] == True):
        count += 1
count
# or
len([elem for elem in jdata if (elem['userId'] == 7) and (elem['completed'] == True) ])

9

In [ ]:
url_posts = "https://jsonplaceholder.typicode.com/posts"

url_users = "https://jsonplaceholder.typicode.com/users"